Белгипрозем_2017/src/InformationRegisters/HTMLПредставленияСодержанияПисем/HTMLПредставленияСодержанияПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>HTMLПредставленияСодержанияПисем</name>
  <resources>
    <name>ТекстHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/HTMLПредставленияСодержанияПисем/ManagerModule.bsl
// Возвращает HTML представление письма
//
Функция Прочитать(Письмо) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ТекстHTMLХранилище.Получить();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Устанавливает HTML представление письма
//
Процедура Записать(Письмо, ТекстHTML) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Прочитать();
	
	Запись.Письмо = Письмо;
	Запись.ТекстHTMLХранилище = Новый ХранилищеЗначения(ТекстHTML, Новый СжатиеДанных);
	Запись.ДатаЗаписи = ТекущаяДатаСеанса();
	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Очищает HTML представление письма
//
Процедура Удалить(Письмо) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Очищает записи регистра с ДатаЗаписи < Дата
//
Процедура ОчиститьУстаревшиеЗаписи(Дата) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	HTMLПредставленияСодержанияПисем.Письмо
		|ИЗ
		|	РегистрСведений.HTMLПредставленияСодержанияПисем КАК HTMLПредставленияСодержанияПисем
		|ГДЕ
		|	HTMLПредставленияСодержанияПисем.ДатаЗаписи < &Дата");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Удалить(Выборка.Письмо);
	КонецЦикла;
	
КонецПроцедуры
